# 1  21 31 101 121 131 программист
# 2 3 4 22 - 24  32 - 34 102 - 104 122 - 124 программиста
# 0 5 - 20 25 -30 105 - 120 125 - 130 программистов

N = int(input())
if ((N % 10) == 1) and (N != 111) and (N != 211) and (N != 311) and (N != 411) and (N != 511) and (N != 611) and (N != 711) and (N != 811) and (N != 911) :
    print(N, 'программист')
elif (2 <= N <= 4) or ((N % 10) == 2) and (N != 112) and (N != 212) and (N != 312) and (N != 412) and (N != 512) and (N != 612) and (N != 712) and (N != 812) and (N != 912) or ((N % 10) == 3) and (N != 113) and (N != 213) and (N != 313) and (N != 413) and (N != 513) and (N != 613) and (N != 713) and (N != 813) and (N != 913) or ((N % 10) == 4) and (N != 114) and (N != 214) and (N != 314) and (N != 414) and (N != 514) and (N != 614) and (N != 714) and (N != 814) and (N != 914):
    print(N, 'программиста')
else:
    print(N, 'программистов')
# print((N % 100) // 10)
print(N % 10)
# not[111,211,311,411,511,611,711,811,911] (N != 111)
